"use strict";
//--------------------------1------------------------------

/*Объяви две переменные хранящие название и цену товара: name и price
Присвой переменным следующие характеристики товара (сразу при объявлении)
    название: Генератор защитного поля
    цена: 1000
Используя шаблонную строку выведи в консоль информацию о товаре, получится: 'Выбран «Генератор защитного поля», цена за штуку 1000 кредитов'.
Присвой товару новую цену - 2000
Используя шаблонную строку выведи в консоль информацию о товаре, получится: 'Выбран «Генератор защитного поля», цена за штуку 2000 кредитов'.
*/

// let price = 1000;
// const name = "Генератор защитного поля";
// console.log(`Выбран <<${name}>>, цена за штуку ${price} кредитов`);
// price = 2000;
// console.log(`Выбран <<${name}>>, цена за штуку ${price} кредитов`);

//------------------------------2-----------------------------------
/*
Напиши скрипт проверки количества товаров на складе. Есть переменные total (количество товаров на складе) и ordered (единиц товара в заказе).
Сравни эти значения и по результатам выведи:
    Если в заказе указано число, превышающее количество товаров на складе, то выведи сообщение "На складе недостаточно твоаров!".
    В другом случае выводи сообщение "Заказ оформлен, с вами свяжется менеджер".
Проверь работоспособность кода с разными значениями переменной ordered, например 20, 80 и 130.
const total = 100;
const ordered = 50;
*/

// const total = 100;
// const ordered = 120;
// if (ordered > total) {
//   console.log("На складе недостаточно твоаров!");
// } else {
//   console.log("Заказ оформлен, с вами свяжется менеджер");
// }

//--------------------------------3-------------------------
/*
Напиши скрипт имитирующий авторизацию администратора в панели управления.
Есть переменная message в которую будет записано сообщение о результате. При загрузке страницы у посетителя запрашивается пароль через prompt:
    Если нажали Cancel, записать в message строку 'Отменено пользователем!'
    В протовном случае, если введен пароль который совпадает со значением константы ADMIN_PASSWORD, записать в message строку 'Добро пожаловать!'
    В противном случае, то есть если ни одно из предыдущих условий не выполнилось, записать в message строку 'Доступ запрещен, неверный пароль!'
    После всех проверок вывести в alert значение переменной message.
const ADMIN_PASSWORD = 'jqueryismyjam';
let message;
*/

// let message;
// const messageUser = prompt("Введите пожалуйста пароль");
// const ADMIN_PASSWORD = "asd";
// if (messageUser === null) {
//   message = "Отменено пользователем!";
// } else if (messageUser === ADMIN_PASSWORD) {
//   message = "Добро пожаловать!";
// } else {
//   message = "Доступ запрещен, неверный пароль!";
// }
// console.log(message);

//------------------------------------4----------------------------
/*
На счету пользователя есть 23580 кредитов, значение хранится в переменной credits (создай и присвой). Пользователь решает купить ремонтных дроидов, которые стоят по 3000 кредитов за штуку. Цена одного дроида хранится в переменной pricePerDroid (создай и присвой).
При посещении страницы, используя prompt, необходимо спросить количество дроидов которые пользователь хочет купить и сохранить в переменную.
Напиши скрипт который:
    Если в prompt была нажата кнопка Cancel, выводит в консоль сообщение 'Отменено пользователем!'.
    В противном случае, рассчитывает общую цену заказа и сохраняет в переменной totalPrice.
    Проверяет сможет ли пользователь оплатить заказ:
        если сумма к оплате превышает количество кредитов на счету, выводи в консоль сообщение 'Недостаточно средств на счету!'.
        в противном случае необходимо посчитать остаток кредитов на счету и вывести сообщение 'Вы купили [число] дроидов, на счету осталось [число] кредитов.'.
*/

// const credits = 23580;
// const pricePerDroid = 3000;
// let message;
// let orderedUser = prompt("Какое количество Вам нужно ?");
// let totalPrice = pricePerDroid * orderedUser;
// if (orderedUser === null) {
//   message = "Отменено пользователем!";
// } else if (totalPrice > credits) {
//   message = "Недостаточно средств на счету!";
// } else {
//   message = `Вы купили ${orderedUser} дроидов, на счету осталось ${credits -
//     totalPrice} кредитов.`;
// }
// console.log(message);

//----------------------------5------------------------------------------
/*
Пользователь может оформить доставку товара к себе в страну, указав ее при посещении страницы в prompt. Учти, пользователь может ввести имя страны не только буквами нижнего регистра, а к примеру 'кИтАЙ'.
Напиши скрипт который выводит сообщение о стоимости доставки в указанную страну. Обязательно используй switch. Формат сообщения: 'Доставка в [страна] будет стоить [цена] кредитов'.
Но доставка есть не везде, если указанной страны нет в списке, то выводи в alert сообщение 'В вашей стране доставка не доступна'.
Ниже приведен список стран и стоимость доставки.
    Китай - 100 кредитов
    Чили - 250 кредитов
    Австралия - 170 кредитов
    Индия - 80 кредитов
    Ямайка - 120 кредитов
*/

// let nameCountry;
// let costDelivery;
// let message;
// const userCountry = prompt("Введите название Вашей страны");
// // console.log(`То что ввел клиент ${userCountry}`); // ДЛЯ ПРОВЕРКИ
// if (userCountry === null) {
//   message = "Вы отменили запрос, жаль.";
// } else {
//   switch (userCountry.toLowerCase()) {
//     case "китай":
//       nameCountry = "Китай";
//       costDelivery = 100;
//       message = `Доставка в ${nameCountry} будет стоить ${costDelivery} кредитов`;
//       break;
//     case "чили":
//       nameCountry = "Чили";
//       costDelivery = 250;
//       message = `Доставка в ${nameCountry} будет стоить ${costDelivery} кредитов`;
//       break;
//     case "австралия":
//       nameCountry = "Австралия";
//       costDelivery = 170;
//       message = `Доставка в ${nameCountry} будет стоить ${costDelivery} кредитов`;
//       break;
//     case "индия":
//       nameCountry = "Индия";
//       costDelivery = 80;
//       message = `Доставка в ${nameCountry} будет стоить ${costDelivery} кредитов`;
//       break;
//     case "ямайка":
//       nameCountry = "Ямайка";
//       costDelivery = 120;
//       message = `Доставка в ${nameCountry} будет стоить ${costDelivery} кредитов`;
//       break;
//     default:
//       alert("В вашей стране доставка не доступна");
//       break;
//   }
// }
// console.log(message);

//----------------------------------------------------6-----------------------
/*
Напиши скрипт который просит посетителя ввести число в prompt до тех пор, пока посетитель на нажмет Cancel и каждый раз добавляет введенное значение к общей сумме.
    При загрузке страницы пользователю предлагается в prompt ввести число. Ввод добавляется к значению переменной total.
    Операция ввода числа продолжается до тех пор, пока пользователь не нажмет кнопку Cancel в prompt.
    После того как пользователь прекратил ввод нажав кнопку Cancel, показать alert со строкой 'Общая сумма чисел равна [сумма]'.
    bell Делать проверку того, что пользователь ввел именно число, а не произвольный набор символов, не нужно. Если хочешь, в случае некорректного ввода, показывай alert с текстом 'Было введено не число, попробуйте еще раз', при этом результат prompt плюсовать к общей сумме не нужно, после чего снова пользователю предлагается ввести число в prompt.
let input;
let total = 0;
*/

// let input;
// let sum = 0;
// while (input !== null) {
//   input = prompt("Введите любое число");
//   console.log(input);
//   let isNumber = Number(input);
//   if (input === null) {
//     console.log("Пользователь прекратил ввод");
//   } else if (Number.isNaN(isNumber)) {
//     alert("Было введено не число, попробуйте еще раз");
//   } else {
//     sum += isNumber;
//   }
// }
// console.log(`Сумма всех чисел составила ${sum}`);
